konf/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>фл_ПодсветитьСтроку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда                                                                   
		
		Элементы.Год.Видимость = Истина;
		
		Для СЧ = 0 По 2 Цикл
			Элементы.Год.СписокВыбора.Вставить(СЧ, НачалоГода(ДобавитьМесяц(ТекущаяДатаСеанса(), 12 * СЧ - 12)),СтрЗаменить(Год(ДобавитьМесяц(ТекущаяДатаСеанса(), 12 * СЧ - 12)),Символы.НПП,""),,);
		КонецЦикла;  
		
	Иначе 
		
		Элементы.ГодНадпись.Видимость = Истина;
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриАктивизацииСтроки(Элемент)
	ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриАктивизацииЯчейки(Элемент)
	ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ДатаНачала = ТекущиеДанные.ДатаНачала;
	ДатаОкончания = ТекущиеДанные.ДатаОкончания;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат;	
	КонецЕсли;
	
	ДатыВерны = ПроверитьКорректностьВводаДат(ДатаНачала, ДатаОкончания);
	Если НЕ ДатыВерны Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания должна быть больше чем Дата начала.");
		ТекущиеДанные.ДатаНачала = Неопределено;
		Возврат;
	КонецЕсли; 
	
	КолВоДней = ВернутьКолВоДнейОтпуска(ДатаНачала, ДатаОкончания);
	
	ТекущиеДанные.КолВоДней = КолВоДней;   
	
	ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ДатаНачала = ТекущиеДанные.ДатаНачала;
	ДатаОкончания = ТекущиеДанные.ДатаОкончания;	
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат;	
	КонецЕсли;
	
	ДатыВерны = ПроверитьКорректностьВводаДат(ДатаНачала, ДатаОкончания);
	Если НЕ ДатыВерны Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания должна быть больше чем Дата начала.");
		ТекущиеДанные.ДатаОкончания = Неопределено;
		Возврат;
	КонецЕсли; 
	
	КолВоДней = ВернутьКолВоДнейОтпуска(ДатаНачала, ДатаОкончания);
	
	ТекущиеДанные.КолВоДней = КолВоДней;  
	
	ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
	
КонецПроцедуры  


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДиаграммуГанта(Команда) 
	
	АдресХранилища = ПоказатьДиаграммуГантаНаСервере();
	
	ПараметрыВвода = Новый Структура("АдресХранилища",АдресХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",ПараметрыВвода,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьКорректностьВводаДат(ДатаНачала, ДатаОкончания)
	
	Результат = Истина;
	
	Если ДатаНачала >= ДатаОкончания Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции


&НаКлиенте
Функция ВернутьКолВоДнейОтпуска(ДатаНачала, ДатаОкончания)
	
	КолВоДней = 0;
	КолВоДней = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала) + 1)/86400;	
	
	Возврат КолВоДней;
	
КонецФункции    

&НаСервере
Процедура ПодсветитьСтрокиСБольшимКолВомДнейНаСервере();
	
	Если ЗначениеЗаполнено(Объект.ОтпускаСотрудников) Тогда
		
		ТЗ_Отпуск = Объект.ОтпускаСотрудников.Выгрузить();
		
		ТЗ_Отпуск.Свернуть("Сотрудник", "КолВоДней");
		
		
		Для Каждого СтрокаТЗ Из ТЗ_Отпуск Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник", СтрокаТЗ.Сотрудник);
			
			НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);
			
			
			Если СтрокаТЗ.КолВоДней > 28 Тогда  //Надо подсветить строки
				
				Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
					
					Если НЕ СтрокаТЧ.фл_ПодсветитьСтроку Тогда
						СтрокаТЧ.фл_ПодсветитьСтроку = Истина;	 
					КонецЕсли;
					
				КонецЦикла
				
			Иначе  //Не надо подсвечивать строки
				
				Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
					
					Если СтрокаТЧ.фл_ПодсветитьСтроку Тогда
						СтрокаТЧ.фл_ПодсветитьСтроку = Ложь;	 
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПоказатьДиаграммуГантаНаСервере()
	
	ТЗ_Отпуск = Объект.ОтпускаСотрудников.Выгрузить();
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ТЗ_Отпуск,УникальныйИдентификатор);
	
	Возврат АдресХранилища	
КонецФункции

#КонецОбласти
